## Finding Nulls in Pandas Data Frames

### Paulo Cysne Rios Jr. | Oct 23, 2017

In [1]:
import pandas as pd

In [2]:
sales = {"1Q": [234, None, 321, None],
         "2Q": [189, 310, 219, 41],
         "3Q": [156, None, None, None],
         "4Q": [192, 256, 210, None]}

In [3]:
sales_df = pd.DataFrame(sales, 
                        index = ["shoes", "electronics", 
                                 "books", "clothing"])

In [4]:
sales_df

                1Q   2Q     3Q     4Q
shoes        234.0  189  156.0  192.0
electronics    NaN  310    NaN  256.0
books        321.0  219    NaN  210.0
clothing       NaN   41    NaN    NaN

In [6]:
sales_df.isnull()

                1Q     2Q     3Q     4Q
shoes        False  False  False  False
electronics   True  False   True  False
books        False  False   True  False
clothing      True  False   True   True

In [7]:
sales_df.isnull().any()

1Q     True
2Q    False
3Q     True
4Q     True
dtype: bool

In [9]:
sales_df.isnull().sum() # nr. of nulls per column

1Q    2
2Q    0
3Q    3
4Q    1
dtype: int64